In [1]:
import pandas as pd

### Pandas
1. Creation (Series/DataFrame -> List,tuple,dictionary,numpyarray)
2. Data Accessing/Management
3. Logical Indexing
4. Attributes (shape, size, dtype, values, index, columns)
5. Viewing (head,tail,sample)
6. Statistical Functions (sum,max,min,mean,median,quantile,var,corr,describe)
7. String Functions
8. Function Application
9. Data Merging (merge,concate)
10. Data Grouping / Aggregation
11. Missing Data Problem
12. File Handling
13. Date/Time Functionality
14. Utility Functions (renaming/transformation)
15. Graphical Visualization

In [2]:
{'name':['akshita','aakash','aaryan','anamika'],'age':[19,28,20,21],'salary':[20000,60000,20000,16000]}

{'name': ['akshita', 'aakash', 'aaryan', 'anamika'],
 'age': [19, 28, 20, 21],
 'salary': [20000, 60000, 20000, 16000]}

In [3]:
df = pd.DataFrame({'name':['akshita','aakash','aaryan','anamika'],'age':[19,28,20,21],'salary':[20000,60000,20000,16000]})
df

      name  age  salary
0  akshita   19   20000
1   aakash   28   60000
2   aaryan   20   20000
3  anamika   21   16000

In [4]:
s = pd.Series({'name':['akshita','aakash','aaryan','anamika'],'age':[19,28,20,21],'salary':[20000,60000,20000,16000]})
s

name      [akshita, aakash, aaryan, anamika]
age                         [19, 28, 20, 21]
salary          [20000, 60000, 20000, 16000]
dtype: object

In [5]:
df['name']

0    akshita
1     aakash
2     aaryan
3    anamika
Name: name, dtype: object

In [6]:
df['age']

0    19
1    28
2    20
3    21
Name: age, dtype: int64

In [7]:
df[['name','age']]

      name  age
0  akshita   19
1   aakash   28
2   aaryan   20
3  anamika   21

In [8]:
df[['name']]

      name
0  akshita
1   aakash
2   aaryan
3  anamika

In [9]:
s

name      [akshita, aakash, aaryan, anamika]
age                         [19, 28, 20, 21]
salary          [20000, 60000, 20000, 16000]
dtype: object

In [10]:
s['name']

['akshita', 'aakash', 'aaryan', 'anamika']

In [11]:
s.index

Index(['name', 'age', 'salary'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
df.columns

Index(['name', 'age', 'salary'], dtype='object')

In [14]:
df1 = pd.DataFrame([[3,'nice',1999],[8,'woo',1998],[6,'go',2001]], index=['a','b','c'],columns=['rank','word','year'])
df1

   rank  word  year
a     3  nice  1999
b     8   woo  1998
c     6    go  2001

In [15]:
df1.columns

Index(['rank', 'word', 'year'], dtype='object')

In [16]:
df1.columns[0]

'rank'

In [17]:
df1.index

Index(['a', 'b', 'c'], dtype='object')

In [18]:
# df1.loc[0] # this doesn't work

In [19]:
list('abcde')

['a', 'b', 'c', 'd', 'e']

In [20]:
s1 = pd.Series([5,7,3,7,3],index=list('abcde'), name='MeraName')
s1

a    5
b    7
c    3
d    7
e    3
Name: MeraName, dtype: int64

In [21]:
s1['a']

5

In [22]:
s1[0]

5

In [23]:
s1.values

array([5, 7, 3, 7, 3], dtype=int64)

In [24]:
s2 = pd.Series([5,7,3,7,3],index=[4,56,2,5,3])
s2

4     5
56    7
2     3
5     7
3     3
dtype: int64

In [25]:
s2.values[0]

5

In [26]:
s2.values.tolist()

[5, 7, 3, 7, 3]

##### Logical Indexing

In [27]:
df

      name  age  salary
0  akshita   19   20000
1   aakash   28   60000
2   aaryan   20   20000
3  anamika   21   16000

Que: People (Names) whos salary equal to 20K

In [28]:
df['name']

0    akshita
1     aakash
2     aaryan
3    anamika
Name: name, dtype: object

In [29]:
df['salary']

0    20000
1    60000
2    20000
3    16000
Name: salary, dtype: int64

In [30]:
df['salary'] == 20000

0     True
1    False
2     True
3    False
Name: salary, dtype: bool

In [31]:
df['name'][0]

'akshita'

In [32]:
df['name'][0:3]

0    akshita
1     aakash
2     aaryan
Name: name, dtype: object

In [33]:
df['name'][[True,False,True,True]]

0    akshita
2     aaryan
3    anamika
Name: name, dtype: object

In [34]:
df['name'][[0,3]]

0    akshita
3    anamika
Name: name, dtype: object

In [35]:
df['name'][df['salary']==20000]

0    akshita
2     aaryan
Name: name, dtype: object

In [36]:
df['name'][df['salary']==20000].values.tolist()

['akshita', 'aaryan']

In [37]:
df

      name  age  salary
0  akshita   19   20000
1   aakash   28   60000
2   aaryan   20   20000
3  anamika   21   16000

Que: how many people are having age above 20

In [38]:
sum(df['age']>20)

2

In [39]:
(df['age']>20).count()

4

In [40]:
df['age']>20

0    False
1     True
2    False
3     True
Name: age, dtype: bool

Food/Travel/Books/Programming/TVshows/sports/dance/songs/

In [41]:
food = pd.DataFrame({
    'name':['pizza','dosa','mirchi bada','paav bhaji','burger','dhokla','chhola bhathura','manchurian','momos','noodles','pani puri','chilly paneer','khoya paneer','honey chilly potato'],
    'cuisine':['italian','indian','indian','indian','german','indian','indian','chinese','chinese','chinese','indian','indian','indian','indo chinese'],
    'price':[120,60,20,50,40,100,70,140,40,60,30,130,140,160],
    'restaurant':['pizza hut','anna','anand ji','anand ji', 'burger singh','gujju da dhabha', 'anand ji','chinchen','chinchen','chinchen','anand ji','gujju da dhabha','gujju da dhabha','chinchen'],
    'offer':[10,0,5,5,30,10,30,10,0,0,0,30,30,50]
})
food

                   name       cuisine  price       restaurant  offer
0                 pizza       italian    120        pizza hut     10
1                  dosa        indian     60             anna      0
2           mirchi bada        indian     20         anand ji      5
3            paav bhaji        indian     50         anand ji      5
4                burger        german     40     burger singh     30
5                dhokla        indian    100  gujju da dhabha     10
6       chhola bhathura        indian     70         anand ji     30
7            manchurian       chinese    140         chinchen     10
8                 momos       chinese     40         chinchen      0
9               noodles       chinese     60         chinchen      0
10            pani puri        indian     30         anand ji      0
11        chilly paneer        indian    130  gujju da dhabha     30
12         khoya paneer        indian    140  gujju da dhabha     30
13  honey chilly potato  indo chinese    160         chinchen     50

que 1: find the costliest food (name)
que 2: find the cheapest indian food
que 3: what is avg price of chinese food
que 4: cuisine of cheapest food
que 5: avg price of food at anand ji's restaurant
que 6: top 2 restaurants with number of varieties in food
que 7: which resturant is offering highest avg discount

In [62]:
# que 1
food['name'][food['price'] == food['price'].max()].values.tolist()

['honey chilly potato']

In [81]:
food['name'][food['price'].idxmax()]

'honey chilly potato'

In [65]:
food[['name','price']][food['price'] == food['price'].max()].values

array([['honey chilly potato', 160]], dtype=object)

In [67]:
# que 2
indian = food[food['cuisine']=='indian']
indian

               name cuisine  price       restaurant  offer
1              dosa  indian     60             anna      0
2       mirchi bada  indian     20         anand ji      5
3        paav bhaji  indian     50         anand ji      5
5            dhokla  indian    100  gujju da dhabha     10
6   chhola bhathura  indian     70         anand ji     30
10        pani puri  indian     30         anand ji      0
11    chilly paneer  indian    130  gujju da dhabha     30
12     khoya paneer  indian    140  gujju da dhabha     30

In [69]:
indian['name'][indian['price']==indian['price'].min()].values

array(['mirchi bada'], dtype=object)

In [74]:
food['name'][food[food['cuisine']=='indian']['price'].idxmin()]

'mirchi bada'

In [75]:
# que 3
food['price'][food['cuisine']=='chinese'].mean()

80.0

In [80]:
# que 4
food['cuisine'][food['price']==food['price'].min()].values

array(['indian'], dtype=object)

In [78]:
food['cuisine'][food['price'].idxmin()]

'indian'

In [82]:
# que 5
food['price'][food['restaurant'] == 'anand ji'].mean()

42.5

In [84]:
# que 6
food['restaurant'].value_counts().head(2)

chinchen    4
anand ji    4
Name: restaurant, dtype: int64

In [85]:
food['restaurant'].value_counts().head(2).index

Index(['chinchen', 'anand ji'], dtype='object')

In [86]:
food

                   name       cuisine  price       restaurant  offer
0                 pizza       italian    120        pizza hut     10
1                  dosa        indian     60             anna      0
2           mirchi bada        indian     20         anand ji      5
3            paav bhaji        indian     50         anand ji      5
4                burger        german     40     burger singh     30
5                dhokla        indian    100  gujju da dhabha     10
6       chhola bhathura        indian     70         anand ji     30
7            manchurian       chinese    140         chinchen     10
8                 momos       chinese     40         chinchen      0
9               noodles       chinese     60         chinchen      0
10            pani puri        indian     30         anand ji      0
11        chilly paneer        indian    130  gujju da dhabha     30
12         khoya paneer        indian    140  gujju da dhabha     30
13  honey chilly potato  indo chinese    160         chinchen     50

In [89]:
# que 7
offers = []
ress = []
for res in food['restaurant'].unique():
    offers.append(food['offer'][food['restaurant']==res].mean())
    ress.append(res)

In [90]:
offers

[10.0, 0.0, 10.0, 30.0, 23.333333333333332, 15.0]

In [91]:
ress

['pizza hut',
 'anna',
 'anand ji',
 'burger singh',
 'gujju da dhabha',
 'chinchen']

In [92]:
offer = pd.DataFrame({'off':offers,'rest':ress})
offer

         off             rest
0  10.000000        pizza hut
1   0.000000             anna
2  10.000000         anand ji
3  30.000000     burger singh
4  23.333333  gujju da dhabha
5  15.000000         chinchen

In [93]:
offer['rest'][offer['off'].idxmax()]

'burger singh'

# Statistical Functions
min
max
sum
count
corr
corrwith
quantile
std
var

In [42]:
food.columns

Index(['name', 'cuisine', 'price', 'restaurant', 'offer'], dtype='object')

In [44]:
food['price'].sum()

1160

In [45]:
food['price'].std()

47.300767830582174

In [46]:
food['price'].min()

20

In [47]:
food['price'].max()

160

In [48]:
food['price'].mean()

82.85714285714286

In [50]:
food['price'].median()

65.0

In [51]:
food['price'].quantile(0.25)

42.5

In [52]:
food['price'].quantile(0.75)

127.5

##### String Functions

In [54]:
food['cuisine']

0          italian
1           indian
2           indian
3           indian
4           german
5           indian
6           indian
7          chinese
8          chinese
9          chinese
10          indian
11          indian
12          indian
13    indo chinese
Name: cuisine, dtype: object

In [55]:
st = 'hello'

In [56]:
st.upper()

'HELLO'

In [57]:
len(st.split())

1

In [60]:
# for i in food['cuisine']:
#     print(i.upper())

In [61]:
cui = food['cuisine']

In [62]:
cui.str.upper()

0          ITALIAN
1           INDIAN
2           INDIAN
3           INDIAN
4           GERMAN
5           INDIAN
6           INDIAN
7          CHINESE
8          CHINESE
9          CHINESE
10          INDIAN
11          INDIAN
12          INDIAN
13    INDO CHINESE
Name: cuisine, dtype: object

In [63]:
food['cuisine'] = food['cuisine'].str.upper()

In [64]:
food

                   name       cuisine  price       restaurant  offer
0                 pizza       ITALIAN    120        pizza hut     10
1                  dosa        INDIAN     60             anna      0
2           mirchi bada        INDIAN     20         anand ji      5
3            paav bhaji        INDIAN     50         anand ji      5
4                burger        GERMAN     40     burger singh     30
5                dhokla        INDIAN    100  gujju da dhabha     10
6       chhola bhathura        INDIAN     70         anand ji     30
7            manchurian       CHINESE    140         chinchen     10
8                 momos       CHINESE     40         chinchen      0
9               noodles       CHINESE     60         chinchen      0
10            pani puri        INDIAN     30         anand ji      0
11        chilly paneer        INDIAN    130  gujju da dhabha     30
12         khoya paneer        INDIAN    140  gujju da dhabha     30
13  honey chilly potato  INDO CHINESE    160         chinchen     50

In [65]:
food['cuisine'].apply(lambda x:len(x.split()))

0     1
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
12    1
13    2
Name: cuisine, dtype: int64

In [66]:
food['restaurant'].apply(lambda x:len(x.split()))

0     2
1     1
2     2
3     2
4     2
5     3
6     2
7     1
8     1
9     1
10    2
11    3
12    3
13    1
Name: restaurant, dtype: int64

In [67]:
df = pd.DataFrame({'id':[1,2,3,4,5],'name':['vishal','vijay','vinod','vikram','vihaan']})

In [68]:
df

   id    name
0   1  vishal
1   2   vijay
2   3   vinod
3   4  vikram
4   5  vihaan

In [71]:
df1 = pd.DataFrame({'id':[4,6,2,7,1,5],'subject':['SE','EDC','uP','Python','Python','DSA']})
df1

   id subject
0   4      SE
1   6     EDC
2   2      uP
3   7  Python
4   1  Python
5   5     DSA

In [72]:
pd.merge(df,df1,on='id')

   id    name subject
0   1  vishal  Python
1   2   vijay      uP
2   4  vikram      SE
3   5  vihaan     DSA

In [73]:
pd.merge(df,df1,on='id',how='left')

   id    name subject
0   1  vishal  Python
1   2   vijay      uP
2   3   vinod     NaN
3   4  vikram      SE
4   5  vihaan     DSA

In [74]:
pd.merge(df,df1,on='id',how='right')

   id    name subject
0   4  vikram      SE
1   6     NaN     EDC
2   2   vijay      uP
3   7     NaN  Python
4   1  vishal  Python
5   5  vihaan     DSA

In [75]:
pd.merge(df,df1,on='id',how='outer')

   id    name subject
0   1  vishal  Python
1   2   vijay      uP
2   3   vinod     NaN
3   4  vikram      SE
4   5  vihaan     DSA
5   6     NaN     EDC
6   7     NaN  Python

In [76]:
df

   id    name
0   1  vishal
1   2   vijay
2   3   vinod
3   4  vikram
4   5  vihaan

In [77]:
df2 = pd.DataFrame({'id':[7,8,23],'name':['saina','sneha','shruti']})

In [78]:
df2

   id    name
0   7   saina
1   8   sneha
2  23  shruti

In [79]:
df3 = pd.DataFrame({'age':[20,18,19,20,21,22,24,21]})
df3

   age
0   20
1   18
2   19
3   20
4   21
5   22
6   24
7   21

In [85]:
ddf1 = pd.concat([df,df2])
ddf1

   id    name
0   1  vishal
1   2   vijay
2   3   vinod
3   4  vikram
4   5  vihaan
0   7   saina
1   8   sneha
2  23  shruti

In [82]:
ddf = pd.concat([df,df2],ignore_index=True)
ddf

   id    name
0   1  vishal
1   2   vijay
2   3   vinod
3   4  vikram
4   5  vihaan
5   7   saina
6   8   sneha
7  23  shruti

In [86]:
pd.concat([ddf,df3])

     id    name   age
0   1.0  vishal   NaN
1   2.0   vijay   NaN
2   3.0   vinod   NaN
3   4.0  vikram   NaN
4   5.0  vihaan   NaN
5   7.0   saina   NaN
6   8.0   sneha   NaN
7  23.0  shruti   NaN
0   NaN     NaN  20.0
1   NaN     NaN  18.0
2   NaN     NaN  19.0
3   NaN     NaN  20.0
4   NaN     NaN  21.0
5   NaN     NaN  22.0
6   NaN     NaN  24.0
7   NaN     NaN  21.0

In [84]:
pd.concat([ddf,df3],axis=1)

   id    name  age
0   1  vishal   20
1   2   vijay   18
2   3   vinod   19
3   4  vikram   20
4   5  vihaan   21
5   7   saina   22
6   8   sneha   24
7  23  shruti   21

In [88]:
# pd.concat([ddf1,df3],axis=1) # not allowed because index are not matching up

##### Grouping

In [89]:
#que 7: which resturant is offering highest avg discount

In [92]:
g = food.groupby('restaurant')

In [93]:
g.groups

{'anand ji': [2, 3, 6, 10], 'anna': [1], 'burger singh': [4], 'chinchen': [7, 8, 9, 13], 'gujju da dhabha': [5, 11, 12], 'pizza hut': [0]}

In [95]:
g['price'].mean()

restaurant
anand ji            42.500000
anna                60.000000
burger singh        40.000000
chinchen           100.000000
gujju da dhabha    123.333333
pizza hut          120.000000
Name: price, dtype: float64

In [98]:
# Solution to que 7
food.groupby('restaurant')['offer'].mean().idxmax()

'burger singh'

In [99]:
food.groupby(['restaurant','cuisine']).mean()

                                   price      offer
restaurant      cuisine
anand ji        INDIAN         42.500000  10.000000
anna            INDIAN         60.000000   0.000000
burger singh    GERMAN         40.000000  30.000000
chinchen        CHINESE        80.000000   3.333333
                INDO CHINESE  160.000000  50.000000
gujju da dhabha INDIAN        123.333333  23.333333
pizza hut       ITALIAN       120.000000  10.000000

In [101]:
food.groupby('cuisine').describe().T

cuisine         CHINESE  GERMAN      INDIAN  INDO CHINESE  ITALIAN
price count    3.000000     1.0    8.000000           1.0      1.0
      mean    80.000000    40.0   75.000000         160.0    120.0
      std     52.915026     NaN   44.400772           NaN      NaN
      min     40.000000    40.0   20.000000         160.0    120.0
      25%     50.000000    40.0   45.000000         160.0    120.0
      50%     60.000000    40.0   65.000000         160.0    120.0
      75%    100.000000    40.0  107.500000         160.0    120.0
      max    140.000000    40.0  140.000000         160.0    120.0
offer count    3.000000     1.0    8.000000           1.0      1.0
      mean     3.333333    30.0   13.750000          50.0     10.0
      std      5.773503     NaN   13.822859           NaN      NaN
      min      0.000000    30.0    0.000000          50.0     10.0
      25%      0.000000    30.0    3.750000          50.0     10.0
      50%      0.000000    30.0    7.500000          50.0     10.0
      75%      5.000000    30.0   30.000000          50.0     10.0
      max     10.000000    30.0   30.000000          50.0     10.0

In [102]:
food.groupby('cuisine').describe(include='all').T

cuisine               CHINESE        GERMAN        INDIAN  \
name       count            3             1             8
           unique           3             1             8
           top     manchurian        burger  khoya paneer
           freq             1             1             1
           mean           NaN           NaN           NaN
           std            NaN           NaN           NaN
           min            NaN           NaN           NaN
           25%            NaN           NaN           NaN
           50%            NaN           NaN           NaN
           75%            NaN           NaN           NaN
           max            NaN           NaN           NaN
price      count          3.0           1.0           8.0
           unique         NaN           NaN           NaN
           top            NaN           NaN           NaN
           freq           NaN           NaN           NaN
           mean          80.0          40.0          75.0
           std      52.915026           NaN     44.400772
           min           40.0          40.0          20.0
           25%           50.0          40.0          45.0
           50%           60.0          40.0          65.0
           75%          100.0          40.0         107.5
           max          140.0          40.0         140.0
restaurant count            3             1             8
           unique           1             1             3
           top       chinchen  burger singh      anand ji
           freq             3             1             4
           mean           NaN           NaN           NaN
           std            NaN           NaN           NaN
           min            NaN           NaN           NaN
           25%            NaN           NaN           NaN
           50%            NaN           NaN           NaN
           75%            NaN           NaN           NaN
           max            NaN           NaN           NaN
offer      count          3.0           1.0           8.0
           unique         NaN           NaN           NaN
           top            NaN           NaN           NaN
           freq           NaN           NaN           NaN
           mean      3.333333          30.0         13.75
           std       5.773503           NaN     13.822859
           min            0.0          30.0           0.0
           25%            0.0          30.0          3.75
           50%            0.0          30.0           7.5
           75%            5.0          30.0          30.0
           max           10.0          30.0          30.0

cuisine                   INDO CHINESE    ITALIAN
name       count                     1          1
           unique                    1          1
           top     honey chilly potato      pizza
           freq                      1          1
           mean                    NaN        NaN
           std                     NaN        NaN
           min                     NaN        NaN
           25%                     NaN        NaN
           50%                     NaN        NaN
           75%                     NaN        NaN
           max                     NaN        NaN
price      count                   1.0        1.0
           unique                  NaN        NaN
           top                     NaN        NaN
           freq                    NaN        NaN
           mean                  160.0      120.0
           std                     NaN        NaN
           min                   160.0      120.0
           25%                   160.0      120.0
           50%                   160.0      120.0
           75%                   160.0      120.0
           max                   160.0      120.0
restaurant count                     1          1
           unique                    1          1
           top                chinchen  pizza hut
           freq                      1          1
           mean                    NaN        NaN
           std                     NaN        NaN
           min                     NaN        NaN
           25%                     NaN        NaN
           50%                     NaN        NaN
           75%                     NaN        NaN
           max                     NaN        NaN
offer      count                   1.0        1.0
           unique                  NaN        NaN
           top                     NaN        NaN
           freq                    NaN        NaN
           mean                   50.0       10.0
           std                     NaN        NaN
           min                    50.0       10.0
           25%                    50.0       10.0
           50%                    50.0       10.0
           75%                    50.0       10.0
           max                    50.0       10.0